#include <stdio.h>

int main() {
    int i = 1;
    do {
        if (i == 6) {
            i++;
            continue;
        }
        printf("%d ", i);
        i++;
    } while (i <= 10);
    return 0;
}
//การใช้ do-while + continue
//กำหนดค่า i เท่ากับ 1
//ลูป do-while จะทำงานก่อน 1 รอบ และค่อยตรวจสอบเงื่อนไข (i <= 10)
//เมื่อ i เท่ากับ 6 คำสั่ง continue จะทำงาน ทำให้โปรแกรมข้ามคำสั่ง printf แล้วกลับไปตรวจสอบเงื่อนไขของลูป do-while ใหม่
//เพิ่มค่า i เป็น 7 ภายในเงื่อนไข if เป็นสิ่งสำคัญเพื่อให้โปรแกรมไม่ติดลูปไม่สิ้นสุด (infinite loop) เมื่อ i มีค่าเท่ากับ 6
//และทำให้โปรแกรมยังคงพิมพ์ค่า 1 จนถึง 10 ยกเว้น 6