#include <stdio.h>

int main(){
    int sum, p, x, y;                                            
    sum = 0;
    for (x = 1, y = 1; x<= 15; x++, y += 2){                       
        p = x * y;
        sum = sum + p;
        printf("%d * %d = %d\n", x, y, p);
    }
    printf("summation of x * y = %d\n", sum);
    return 0;
}

//การทำงานของโปรแกรม 
//กำหนดตัวเเปร sum ใช้เก็บผลรวมของ x*y และ p ใช้เก็บผลคูณของ x กับ y
//ค่าเริ่มต้น sum = 0 เริ่มลูป for โดยกำหนดค่า x = 1, y = 1
//เงื่อนไขการทำงานของลูป x ต้องน้อยกว่าหรือเท่ากับ 15 ทุกครั้งที่ลูปทำงาน x จะเพิ่มขึ้นทีละ 1 เเละ y จะเพิ่มขึ้นทีละ 2
//ในการทำงานเเต่ละรอบ จะทำการคูณ x กับ y เเล้วเก็บผลลัพธ์ไว้ที่ p เเละเพิ่มเข้าไปใน sum
//เเสดงผลลัพธ์การคูณของ x กับ y เเต่ละรอบ

//ค่าที่ได้จากโปรเเกรมคือ ใช้ Loop for เพื่อรันค่าของ x เเละ y พร้อมกันโดย x เพิ่มทีละ 1  y เพิ่มทีละ 2
//จะทำการคูณ x กับ y เเล้วนำไปบวกกับ sum เเละเเสดงผลลัพธ์การคูณของเเต่ละรอบ  และแสดงผลรวมทั้งหมด