#include <stdio.h>

int main() {
    int i = 1;
    while (i <= 10) {
        if (i == 6) {
            i++;
            continue;
        }
        printf("%d ", i);
        i++;
    }
    return 0;
}

//การใช้ while + continue
//กำหนดค่า i เท่ากับ 1
//ลูป while จะทำงานเมื่อ i มีค่าน้อยกว่าหรือเท่ากับ 10
//เมื่อ i เท่ากับ 6 คำสั่ง if จะทำงาน ภายใน if มีการเพิ่มค่า i เป็น 7 ก่อน 
//จากนั้น continue จะทำงาน ทำให้โปรแกรมข้ามคำสั่ง printf แล้วกลับไปตรวจสอบเงื่อนไขของลูป while ใหม่
//เพิ่มค่า i ในเงื่อนไข if แล้ว จึงไม่จำเป็นต้องเพิ่มค่า i อีกครั้ง
//และทำให้โปรแกรมยังคงพิมพ์ค่า 1 จนถึง 10 ยกเว้น 6 