#include <stdio.h>

int main() {
    int i;
    for (i = 1; i <= 10; i++) {
        if (i == 6) {
            continue;
        }
        printf("%d ", i);
    }
    return 0;
}

// cp_pt_09-05
//กำหนดตัวเเปร i เพื่อใช้ในการนับจำนวน
//ใช้ for loop กำหนดให้ i เริ่มจาก 1 เเละทำงานต่อไป จนกว่า i <= 10 โดยในเเต่ละรอบจะเพิ่มขึ้นทีละ 1
//ในลูปจะมีเงื่อนไข if เพื่อตรวจสอบว่า i มีค่าเท่ากับ 6 หรือไม่ ถ้าใช่จะใช้คำสั่ง continue เพื่อข้ามการทำงานในรอบนั้น
//ถ้า i ไม่เท่ากับ 6 จะทำการพิมพ์ค่าของ i ออกมา
//โปรเเกรมจะทำซ้ำจนกว่า i จะมากกว่า 10